'use strict';

// Из суммы вычтена комиссия платежной системы за перевод средств и конвертацию валюты.
window.г_мПожертвования =
[
	["2016-04-12",  100, "RUB", "Садовников Олег"      , "PayPal"                   , ""],
	["2016-04-12", 99.5, "RUB", ""                     , "Яндекс.Деньги"            , "спасибо за труд от RuNet) и добра тебе"],
	["2016-04-13",    3, "USD", "TMB"                  , "WebMoney"                 , "На пиво :) Спасибо за твою работу!"],
	["2016-04-13",  500, "RUB", ""                     , "Яндекс.Деньги из Сбербанк", ""],
	["2016-04-13",  145, "RUB", ""                     , "Яндекс.Деньги из КИВИ"    , ""],
	["2016-04-13", 9.95, "RUB", ""                     , "Яндекс.Деньги"            , ""],
	["2016-04-24",   60, "RUB", ""                     , "PayPal"                   , "от iG0Lki - на мороженое :)"],
	["2016-06-08",  294, "RUB", ""                     , "Яндекс.Деньги"            , "Чувак, на пивас. Не вздумай останавливаться)"],
	["2016-07-01",  200, "RUB", "Gritsenko Denis"      , "PayPal"                   , "Отличное расширение! Не забрасывай"],
	["2016-09-16",  200, "RUB", ""                     , "Яндекс.Деньги из Сбербанк", ""],
	["2017-01-09",  200, "RUB", ""                     , "Яндекс.Деньги из Сбербанк", ""],
	["2017-02-07",   55, "RUB", "Oleg Korotych"        , "WebMoney"                 , "Спасибо"],
	["2017-02-07",   10, "RUB", ""                     , "Яндекс.Деньги"            , "спасибо"],
	["2017-02-15", 86.1, "RUB", "Сергей Юрченко"       , "PayPal"                   , "спасибо. классное расширение. правда, не видно описание стрима, где часто FAQ и расписание стримов указывают"],
	["2017-04-05",  305, "RUB", "Omar Alomair"         , "PayPal"                   , ""],
	["2017-04-23", 0.65, "USD", "Miguel Bonaldi"       , "PayPal"                   , "SOY UN DIOS GENEROSO ALV XD"],
	["2017-05-29",  100, "RUB", "Юркин Александр"      , "PayPal"                   , "Единственный адекватный способ просматривать твич. Сяп."],
	["2017-06-02",  194, "RUB", "LittleMontana"        , "Яндекс.Деньги из Сбербанк", ""],
	["2017-06-02",  300, "RUB", "Цапков Алексей"       , "PayPal"                   , "Спасибо за отличное расширение! Использую его в опере и не работает BTTV, можно что-то с этим сделать?"],
	["2017-06-06",  500, "RUB", ""                     , "Яндекс.Деньги"            , "Спаситеееееель ))))"],
	["2017-06-08",  500, "RUB", "Цапков Алексей"       , "PayPal"                   , "Спасибо огромное ещё раз! BTTV заработал в опере Kreygasm"],
	["2017-06-10", 0.82, "BRL", "Alexsandro Schneider" , "PayPal"                   , "Very good plugin"],
	["2017-06-20", 9.15, "USD", "Amogh Bhatawdekar"    , "PayPal"                   , "Love this addon ! Only thing worked to fix my Twitch buffering !! Love Love love Love !!"],
	["2017-06-24",  100, "RUB", ""                     , "Яндекс.Деньги"            , "Отличное расширение, спасибо!"],
	["2017-06-24", 9.16, "USD", "Lucas Passos"         , "PayPal"                   , ""],
	["2017-07-04", 0.35, "USD", "Aleksag"              , "WebMoney"                 , "spasibo"],
	["2017-07-05",  150, "RUB", ""                     , "Яндекс.Деньги"            , "Спасибо за расширение."],
	["2017-07-28", 1000, "RUB", ""                     , "Яндекс.Деньги"            , "Лучший"],
	["2017-07-30",  125, "RUB", "Oleg Korotych"        , "WebMoney"                 , "Спасибо"],
	["2017-07-30",   10, "USD", "Jonathan Kobayashi"   , "PayPal"                   , "Thank you for implementing the chat under the video! You're the first developer that has turned my feedback into reality. Keep up the great work!"],
	["2017-10-24",  575, "RUB", ""                     , "Яндекс.Деньги"            , ""],
	["2017-11-07", 84.6, "RUB", "Eremite B"            , "PayPal"                   , ""],
	["2017-11-11",    1, "EUR", "Jeroen Mennen"        , "PayPal"                   , "https://www.youtube.com/watch?v=M7b80Eb0hR‍k"],
	["2017-11-12",    2, "USD", "Nathaniel Tan"        , "PayPal"                   , ""],
	["2017-12-01",    5, "CHF", "Jan Zimmermann"       , "PayPal"                   , "thanks for making this great extension. it's not a lot. hope it helps :)"],
	["2017-12-13",  500, "RUB", ""                     , "Яндекс.Деньги"            , ""],
	["2017-12-18",   10, "USD", "Fabrice Denis"        , "PayPal"                   , "Great addon. Thank you."],
];

window.г_оВалюта =
{
	RUB: 'р.',
	USD: '$',
	EUR: '€',
	BRL: 'R$',
	CHF: 'Fr.'
};
